
replace_dict={
        '_机器人姓名_':['小通','小黄鸡','小黄鸭','小辣椒','小辣'],
        '_机器人年龄_':['\d+岁'],
        '_色_':['\[色\]'],
        '_偷笑_':['\[偷笑\]'],
        '_奸笑_':['\[奸笑\]'],
        '_笑_':[':D'],
        '_色_':['\[色\]'],
        '_偷笑_':['\[偷笑\]'],
        '_奸笑_':['\[奸笑\]'],
        '_撇嘴_':['\[撇嘴\]'],
        '_委屈_':['\[委屈\]'],
        '_愉快_':['\[愉快\]'],
        '_眦牙_':['\[眦牙\]','\[呲牙\]'],
        '_捂脸_':['\[捂脸\]'],
        '_难过_':['\[难过\]'],
        '_耶_':['\[耶\]'],
        '_皱眉_':['\[皱眉\]'],
        '_害羞_':['\[害羞\]']
        #'_数字_':['\d+'],
        }

custom_dict = {
        '_机器人姓名_':'小辣椒',
        '_机器人年龄_':'2岁',
        '_机器人主人_':'老徐',
        '_机器人售价原价_':'1500',
        '_机器人售价现价_':'1000',
        '_机器人创造者_':'青岩主角科技有限公司',
        '_机器人生日_':'2017/11/11',
        '_色_':'[色]',
        '_偷笑_':'[偷笑]',
        '_奸笑_':'[奸笑]',
        '_笑_':':D',
        '_撇嘴_':'[撇嘴]',
        '_委屈_':'[委屈]',
        '_愉快_':'[愉快]',
        '_眦牙_':'[眦牙]',
        '_捂脸_':'[捂脸]',
        '_难过_':'[难过]',
        '_耶_':'[耶]',
        '_皱眉_':'[皱眉]',
        '_害羞_':'[害羞]'
        #'_数字_':['\d+'],
        }

##%%
#import jieba
#
##%%
#test = '机器人还会打错字的啊？_偷笑_ 这么神奇的？'
#print(list(jieba.cut(test)))